"""text = input("Введите текст с пунктуацией: ")
punt_list = set(",.!?;:-()[]{}\"'…—") # множество символов пунктуаций

total = sum(1 for char in text if char in punt_list) # возвращает +1 если символ из текста входит в множество punt_list и суммирует его

print("Количество знаков пунктуации:", total)


"""
"""import  random
nums_1 = [29, 17, 10, 15, 13, 22, 12, 22, 7, 24, 26, 3, 11, 2, 3, 16, 19, 21, 2, 3, 8, 27, 2, 17, 2, 20, 12, 21, 3, 1]

nums_2 = [16, 21, 30, 24, 5, 7, 23, 13, 11, 5, 21, 5, 19, 9, 12, 9, 15, 16, 29, 8, 16, 1, 22, 15, 16, 9, 1, 13, 21, 21]

num1 = set(nums_1)
num2 = set(nums_2)

num1.remove(min(num1))
num1.add(random.randint(100, 200))

num2.remove(min(num2))
num2.add(random.randint(100, 200))
print("1 множество без минимального элемента и с рандомным числом: ", num1)
print("2 множество без минимального элемента и с рандомным числом: ", num2)

print("Объединение множеств: ", num1 | num2)
print("Пересечение множеств: ", num1 & num2)
print("Разность множеств: ", num2 - num1)"""


text = input("Введите строку: ")




